#include<stdio.h>
#include<ncursesw/curses.h>
#include<stdlib.h>
#include<unistd.h>
#include<locale.h>
/*Todo list*/

/*줄 삭제*/
void DeleteBlock();
/*블럭을 생성하고 내림*/
void Block(int i, char blockInfo[][4]);
/*맵그리기*/
void DrowMap(char map[15][27]);
int key;
int point_x, point_y; //벽돌을 그려주기 위한 포인트
int cur_x =0;//커서의 위치
int cur_y =6;
int x,y;
int time;//sleep이 대신으로 대체함
char map[15][27];
char blockModel[][4][4] =
{//Idia 4차원 배열을 이용하면 호출할 때 좀 더 용이하지 않을까??
	/*첫 번째 블럭1,2,3,4
	  ■
  	  ■ ■ ■   */
	{
	  {0,0,0,0},
	  {1,0,0,0},
	  {1,1,1,0},
	  {0,0,0,0}
	},
	{
	  {0,0,0,0},
	  {1,1,0,0},
	  {1,0,0,0},
	  {1,0,0,0}
	},
	{
	  {0,0,0,0},
	  {1,1,1,0},
	  {0,0,1,0},
	  {0,0,0,0}
	},
	{
	  {0,0,0,0},
	  {0,0,1,0},
	  {0,0,1,0},
	  {0,1,1,0}
	},
	/*두 번째 블럭5,6,7,8
	           ■
	  ■ ■ ■    */
	{
	  {0,0,0,0},
	  {0,0,1,0},
	  {1,1,1,0},
	  {0,0,0,0}
	},
	{
	  {0,0,0,0},
	  {0,1,1,0},
	  {0,0,1,0},
	  {0,0,1,0}
	},
	{
	  {0,0,0,0},
	  {0,1,1,1},
	  {0,1,0,0},
	  {0,0,0,0}
	},
	{
	  {0,1,0,0},
	  {0,1,0,0},
	  {0,1,1,0},
	  {0,0,0,0}
	},
	/*세 번째 블럭9,10,11,12
		■
		■
		■
		■     */
	{
	  {0,1,0,0},
	  {0,1,0,0},
	  {0,1,0,0},
	  {0,1,0,0}
	},
	{
	  {0,0,0,0},
	  {1,1,1,1},
	  {0,0,0,0},
	  {0,0,0,0}
	},
	{
	  {0,0,1,0},
	  {0,0,1,0},
	  {0,0,1,0},
	  {0,0,1,0}
	},
	{
	  {0,0,0,0},
	  {0,0,0,0},
	  {1,1,1,1},
	  {0,0,0,0}
	},
	/*네 번째 블럭13,14
	  ■ ■
	       ■ ■  */
	{
	  {0,0,0,0},
	  {0,1,1,0},
	  {0,0,1,1},
	  {0,0,0,0}
	},
	{
	  {0,0,1,0},
	  {0,1,1,0},
	  {0,1,0,0},
	  {0,0,0,0}
	},
	/*다섯 번째 블럭15,16
	      ■ ■
	 ■ ■  */
	{
	  {0,0,0,0},
	  {0,0,1,1},
	  {0,1,1,0},
	  {0,0,0,0}
	},
	{
	  {0,1,0,0},
	  {0,1,1,0},
	  {0,0,1,0},
	  {0,0,0,0}
	},
	/*여섯 번째 블럭17,18,19,20
	 ■
	 ■ ■ ■  */
	{
	  {0,1,0,0},
	  {1,1,1,0},
	  {0,0,0,0},
	  {0,0,0,0}
	},
	{
	  {0,1,0,0},
	  {0,1,1,0},
	  {0,1,0,0},
	  {0,0,0,0}
	},
	{
	  {0,0,0,0},
	  {0,1,1,1},
	  {0,0,1,0},
	  {0,0,0,0}
	},
	{
	  {0,0,0,0},
	  {0,0,1,0},
	  {0,1,1,0},
	  {0,0,1,0}
	},
	/*일곱 번째 블럭 21
	  ■ ■
	  ■ ■
	*/
	{
	  {0,0,0,0},
	  {0,1,1,0},
	  {0,1,1,0},
	  {0,0,0,0}
	}
};

int main(void)
{
	int i=0;//블럭이 내려오게 하기 위해 씀,
	int j=0;//블럭 모델을 선택하기 위해 씀
	setlocale(LC_CTYPE, "ko.KR.utf-8");//한글 사용을 위해 사용
	nodelay(stdscr, TRUE);
	time=clock();
	keypad(stdscr, TRUE);
	j = rand()%21;
	initscr();
	curs_set(0);
	//맵을 그리고
	while(true){
		i++;
		if((key = getch())==ERR){
			Block(i, blockModel[j]);
		}else{
		switch(key){
			case KEY_UP:
			case KEY_DOWN:
			case KEY_LEFT:
			case KEY_RIGHT:printw("%s","w");refresh();
			}
		}
		printw("%d",i);
		sleep(1);
	}
	endwin();
	return 0;
}

void Block(int i, char blockInfo[][4])
{
	cur_x=+i;
	for(y=0; y<4; y++)
	{
		for(x=0; x<4; x++)
		{
			if(blockInfo[y][x]==1)
			{	
				move(cur_x+x,cur_y+y);
				addch(ACS_CKBOARD);
			}
		}
	}
	refresh();
	sleep(1);
	for(y=0; y<4; y++)
	{
		for(x=0; x<4; x++)
		{
			if(blockInfo[y][x]==1)
			{	
				move(cur_x+x,cur_y+y);
				printw("%s"," ");
			}
		}
	}
}
